In [1]:
import json
import pandas as pd

In [2]:
import json

In [3]:
f = open(r"C:\Users\somen\Desktop\sample.json")
result = json.load(f)

In [4]:
result

{'node': [{'item_1': 'value_11',
   'item_2': 'value_12',
   'item_3': 'value_13',
   'item_4': ['sub_value_14', 'sub_value_15'],
   'item_5': {'sub_item_1': 'sub_item_value_11',
    'sub_item_2': ['sub_item_value_12', 'sub_item_value_13']}},
  {'item_1': 'value_21',
   'item_2': 'value_22',
   'item_4': ['sub_value_24', 'sub_value_25'],
   'item_5': {'sub_item_1': 'sub_item_value_21',
    'sub_item_2': ['sub_item_value_22', 'sub_item_value_23']}}]}

In [29]:
result['node']

[{'item_1': 'value_11',
  'item_2': 'value_12',
  'item_3': 'value_13',
  'item_4': ['sub_value_14', 'sub_value_15'],
  'item_5': {'sub_item_1': 'sub_item_value_11',
   'sub_item_2': ['sub_item_value_12', 'sub_item_value_13']}},
 {'item_1': 'value_21',
  'item_2': 'value_22',
  'item_4': ['sub_value_24', 'sub_value_25'],
  'item_5': {'sub_item_1': 'sub_item_value_21',
   'sub_item_2': ['sub_item_value_22', 'sub_item_value_23']}}]

In [6]:
result['node'][0]

{'item_1': 'value_11',
 'item_2': 'value_12',
 'item_3': 'value_13',
 'item_4': ['sub_value_14', 'sub_value_15'],
 'item_5': {'sub_item_1': 'sub_item_value_11',
  'sub_item_2': ['sub_item_value_12', 'sub_item_value_13']}}

In [7]:
result['node'][1]

{'item_1': 'value_21',
 'item_2': 'value_22',
 'item_4': ['sub_value_24', 'sub_value_25'],
 'item_5': {'sub_item_1': 'sub_item_value_21',
  'sub_item_2': ['sub_item_value_22', 'sub_item_value_23']}}

In [13]:
data = pd.DataFrame(result['node'])

In [14]:
data

,item_1,item_2,item_3,item_4,item_5
0,value_11,value_12,value_13,"[sub_value_14, sub_value_15]","{'sub_item_1': 'sub_item_value_11', 'sub_item_..."
1,value_21,value_22,NaN,"[sub_value_24, sub_value_25]","{'sub_item_1': 'sub_item_value_21', 'sub_item_..."

In [10]:
result['node'][1]['item_5']

{'sub_item_1': 'sub_item_value_21',
 'sub_item_2': ['sub_item_value_22', 'sub_item_value_23']}

In [15]:
data1=pd.DataFrame(result['node'][1]['item_5'])

In [16]:
data1

          sub_item_1         sub_item_2
0  sub_item_value_21  sub_item_value_22
1  sub_item_value_21  sub_item_value_23

In [17]:
data0=pd.DataFrame(result['node'][0]['item_5'])

In [18]:
data0

          sub_item_1         sub_item_2
0  sub_item_value_11  sub_item_value_12
1  sub_item_value_11  sub_item_value_13

In [19]:
data

,item_1,item_2,item_3,item_4,item_5
0,value_11,value_12,value_13,"[sub_value_14, sub_value_15]","{'sub_item_1': 'sub_item_value_11', 'sub_item_..."
1,value_21,value_22,NaN,"[sub_value_24, sub_value_25]","{'sub_item_1': 'sub_item_value_21', 'sub_item_..."

In [20]:
final = pd.concat([data, data0,data1], axis=1)

In [21]:
final

,item_1,item_2,item_3,item_4,item_5,sub_item_1,sub_item_2,sub_item_1,sub_item_2
0,value_11,value_12,value_13,"[sub_value_14, sub_value_15]","{'sub_item_1': 'sub_item_value_11', 'sub_item_...",sub_item_value_11,sub_item_value_12,sub_item_value_21,sub_item_value_22
1,value_21,value_22,NaN,"[sub_value_24, sub_value_25]","{'sub_item_1': 'sub_item_value_21', 'sub_item_...",sub_item_value_11,sub_item_value_13,sub_item_value_21,sub_item_value_23

In [22]:
test=pd.DataFrame(columns=['name','empid'])

In [23]:
test

Empty DataFrame
Columns: [name, empid]
Index: []

In [25]:
test1=pd.DataFrame(columns=['name'])

In [26]:
test1

Empty DataFrame
Columns: [name]
Index: []

In [27]:
type(test1)

pandas.core.frame.DataFrame

In [30]:
import pandas as pd

In [31]:
df1=pd.read_csv(r"C:\Users\somen\Desktop\Pandas_Practice\Sacramentorealestatetransactions.csv"

SyntaxError: unexpected EOF while parsing (<ipython-input-31-629e5667c1a1>, line 1)

In [32]:
df1=pd.read_csv(r"C:\Users\somen\Desktop\Pandas_Practice\Sacramentorealestatetransactions.csv")

In [35]:
df2=pd.DataFrame(df1)

In [38]:
df2.describe()

,zip,beds,baths,sq__ft,price,latitude,longitude
count,985.000000,985.000000,985.000000,985.000000,985.000000,985.000000,985.000000
mean,95750.697462,2.911675,1.776650,1314.916751,234144.263959,38.607732,-121.355982
std,85.176072,1.307932,0.895371,853.048243,138365.839085,0.145433,0.138278
min,95603.000000,0.000000,0.000000,0.000000,1551.000000,38.241514,-121.551704
25%,95660.000000,2.000000,1.000000,952.000000,145000.000000,38.482717,-121.446127
50%,95762.000000,3.000000,2.000000,1304.000000,213750.000000,38.626582,-121.376220
75%,95828.000000,4.000000,2.000000,1718.000000,300000.000000,38.695589,-121.295778
max,95864.000000,8.000000,5.000000,5822.000000,884790.000000,39.020808,-120.597599

In [39]:
res=df2.describe()

In [40]:
res

,zip,beds,baths,sq__ft,price,latitude,longitude
count,985.000000,985.000000,985.000000,985.000000,985.000000,985.000000,985.000000
mean,95750.697462,2.911675,1.776650,1314.916751,234144.263959,38.607732,-121.355982
std,85.176072,1.307932,0.895371,853.048243,138365.839085,0.145433,0.138278
min,95603.000000,0.000000,0.000000,0.000000,1551.000000,38.241514,-121.551704
25%,95660.000000,2.000000,1.000000,952.000000,145000.000000,38.482717,-121.446127
50%,95762.000000,3.000000,2.000000,1304.000000,213750.000000,38.626582,-121.376220
75%,95828.000000,4.000000,2.000000,1718.000000,300000.000000,38.695589,-121.295778
max,95864.000000,8.000000,5.000000,5822.000000,884790.000000,39.020808,-120.597599

In [41]:
res['zip']

count      985.000000
mean     95750.697462
std         85.176072
min      95603.000000
25%      95660.000000
50%      95762.000000
75%      95828.000000
max      95864.000000
Name: zip, dtype: float64

In [42]:
df2

,street,city,zip,state,beds,baths,sq__ft,type,sale_date,price,latitude,longitude
0,3526 HIGH ST,SACRAMENTO,95838,CA,2,1,836,Residential,Wed May 21 00:00:00 EDT 2008,59222,38.631913,-121.434879
1,51 OMAHA CT,SACRAMENTO,95823,CA,3,1,1167,Residential,Wed May 21 00:00:00 EDT 2008,68212,38.478902,-121.431028
2,2796 BRANCH ST,SACRAMENTO,95815,CA,2,1,796,Residential,Wed May 21 00:00:00 EDT 2008,68880,38.618305,-121.443839
3,2805 JANETTE WAY,SACRAMENTO,95815,CA,2,1,852,Residential,Wed May 21 00:00:00 EDT 2008,69307,38.616835,-121.439146
4,6001 MCMAHON DR,SACRAMENTO,95824,CA,2,1,797,Residential,Wed May 21 00:00:00 EDT 2008,81900,38.519470,-121.435768
...,...,...,...,...,...,...,...,...,...,...,...,...
980,9169 GARLINGTON CT,SACRAMENTO,95829,CA,4,3,2280,Residential,Thu May 15 00:00:00 EDT 2008,232425,38.457679,-121.359620
981,6932 RUSKUT WAY,SACRAMENTO,95823,CA,3,2,1477,Residential,Thu May 15 00:00:00 EDT 2008,234000,38.499893,-121.458890
982,7933 DAFFODIL WAY,CITRUS HEIGHTS,95610,CA,3,2,1216,Residential,Thu May 15 00:00:00 EDT 2008,235000,38.708824,-121.256803
983,8304 RED FOX WAY,ELK GROVE,95758,CA,4,2,1685,Residential,Thu May 15 00:00:00 EDT 2008,235301,38.417000,-121.397424
984,3882 YELLOWSTONE LN,EL DORADO HILLS,95762,CA,3,2,1362,Residential,Thu May 15 00:00:00 EDT 2008,235738,38.655245,-121.075915

In [58]:
type(df2['zip'])

pandas.core.series.Series

In [62]:
df3 = pd.DataFrame(df2['zip'].iloc[::2]) ## even idenxed rows

In [103]:
df7=df2.iloc[::2]

In [104]:
df7

,street,city,zip,state,beds,baths,sq__ft,type,sale_date,price,latitude,longitude
0,3526 HIGH ST,SACRAMENTO,95838,CA,2,1,836,Residential,Wed May 21 00:00:00 EDT 2008,59222,38.631913,-121.434879
2,2796 BRANCH ST,SACRAMENTO,95815,CA,2,1,796,Residential,Wed May 21 00:00:00 EDT 2008,68880,38.618305,-121.443839
4,6001 MCMAHON DR,SACRAMENTO,95824,CA,2,1,797,Residential,Wed May 21 00:00:00 EDT 2008,81900,38.519470,-121.435768
6,6048 OGDEN NASH WAY,SACRAMENTO,95842,CA,3,2,1104,Residential,Wed May 21 00:00:00 EDT 2008,90895,38.681659,-121.351705
8,11150 TRINITY RIVER DR Unit 114,RANCHO CORDOVA,95670,CA,2,2,941,Condo,Wed May 21 00:00:00 EDT 2008,94905,38.621188,-121.270555
...,...,...,...,...,...,...,...,...,...,...,...,...
976,2400 INVERNESS DR,LINCOLN,95648,CA,3,2,1358,Residential,Thu May 15 00:00:00 EDT 2008,229027,38.897814,-121.324691
978,5601 REXLEIGH DR,SACRAMENTO,95823,CA,4,2,1715,Residential,Thu May 15 00:00:00 EDT 2008,230000,38.445342,-121.441504
980,9169 GARLINGTON CT,SACRAMENTO,95829,CA,4,3,2280,Residential,Thu May 15 00:00:00 EDT 2008,232425,38.457679,-121.359620
982,7933 DAFFODIL WAY,CITRUS HEIGHTS,95610,CA,3,2,1216,Residential,Thu May 15 00:00:00 EDT 2008,235000,38.708824,-121.256803
984,3882 YELLOWSTONE LN,EL DORADO HILLS,95762,CA,3,2,1362,Residential,Thu May 15 00:00:00 EDT 2008,235738,38.655245,-121.075915

In [101]:
df6= pd.DataFrame(df2['zip'].iloc[1::2]) ## odd indexed rows

In [102]:
df6

       zip
1    95823
3    95815
5    95841
7    95820
9    95673
..     ...
975  95757
977  95823
979  95758
981  95823
983  95758

[492 rows x 1 columns]

In [64]:
df4 = df2[df2.index % 2 == 0]

In [66]:
df5 = df2[df2.index % 2 != 0]

In [67]:
df5

,street,city,zip,state,beds,baths,sq__ft,type,sale_date,price,latitude,longitude
1,51 OMAHA CT,SACRAMENTO,95823,CA,3,1,1167,Residential,Wed May 21 00:00:00 EDT 2008,68212,38.478902,-121.431028
3,2805 JANETTE WAY,SACRAMENTO,95815,CA,2,1,852,Residential,Wed May 21 00:00:00 EDT 2008,69307,38.616835,-121.439146
5,5828 PEPPERMILL CT,SACRAMENTO,95841,CA,3,1,1122,Condo,Wed May 21 00:00:00 EDT 2008,89921,38.662595,-121.327813
7,2561 19TH AVE,SACRAMENTO,95820,CA,3,1,1177,Residential,Wed May 21 00:00:00 EDT 2008,91002,38.535092,-121.481367
9,7325 10TH ST,RIO LINDA,95673,CA,3,2,1146,Residential,Wed May 21 00:00:00 EDT 2008,98937,38.700909,-121.442979
...,...,...,...,...,...,...,...,...,...,...,...,...
975,5024 CHAMBERLIN CIR,ELK GROVE,95757,CA,3,2,1450,Residential,Thu May 15 00:00:00 EDT 2008,228000,38.389756,-121.446246
977,5 BISHOPGATE CT,SACRAMENTO,95823,CA,4,2,1329,Residential,Thu May 15 00:00:00 EDT 2008,229500,38.467936,-121.445477
979,1909 YARNELL WAY,ELK GROVE,95758,CA,3,2,1262,Residential,Thu May 15 00:00:00 EDT 2008,230000,38.417382,-121.484325
981,6932 RUSKUT WAY,SACRAMENTO,95823,CA,3,2,1477,Residential,Thu May 15 00:00:00 EDT 2008,234000,38.499893,-121.458890
983,8304 RED FOX WAY,ELK GROVE,95758,CA,4,2,1685,Residential,Thu May 15 00:00:00 EDT 2008,235301,38.417000,-121.397424

In [69]:
df5.columns

Index(['street', 'city', 'zip', 'state', 'beds', 'baths', 'sq__ft', 'type',
       'sale_date', 'price', 'latitude', 'longitude'],
      dtype='object')

In [70]:
df5.dtypes

street        object
city          object
zip            int64
state         object
beds           int64
baths          int64
sq__ft         int64
type          object
sale_date     object
price          int64
latitude     float64
longitude    float64
dtype: object

In [74]:
df5.dtypes =="object"

street        True
city          True
zip          False
state         True
beds         False
baths        False
sq__ft       False
type          True
sale_date     True
price        False
latitude     False
longitude    False
dtype: bool

In [75]:
df5.street.dtype

dtype('O')

In [76]:
df5.baths.dtype

dtype('int64')

In [77]:
df5.dtypes =="object"

street        True
city          True
zip          False
state         True
beds         False
baths        False
sq__ft       False
type          True
sale_date     True
price        False
latitude     False
longitude    False
dtype: bool

In [89]:
df5.dtypes[df5.dtypes =="object"]

street       object
city         object
state        object
type         object
sale_date    object
dtype: object

In [87]:
df5.dtypes[df5.dtypes =="object"].index

pandas.core.indexes.base.Index

In [107]:
import numpy as np

In [83]:
a=df5.dtypes[df5.dtypes =="object"].index

In [109]:
b=np.where(df5.dtypes[df5.dtypes =="object"])

In [1]:
df5[a]

NameError: name 'df5' is not defined

In [110]:
df5[b]

TypeError: '(array([0, 1, 2, 3, 4], dtype=int64),)' is an invalid key

In [96]:
df2[5:10:]

,street,city,zip,state,beds,baths,sq__ft,type,sale_date,price,latitude,longitude
5,5828 PEPPERMILL CT,SACRAMENTO,95841,CA,3,1,1122,Condo,Wed May 21 00:00:00 EDT 2008,89921,38.662595,-121.327813
6,6048 OGDEN NASH WAY,SACRAMENTO,95842,CA,3,2,1104,Residential,Wed May 21 00:00:00 EDT 2008,90895,38.681659,-121.351705
7,2561 19TH AVE,SACRAMENTO,95820,CA,3,1,1177,Residential,Wed May 21 00:00:00 EDT 2008,91002,38.535092,-121.481367
8,11150 TRINITY RIVER DR Unit 114,RANCHO CORDOVA,95670,CA,2,2,941,Condo,Wed May 21 00:00:00 EDT 2008,94905,38.621188,-121.270555
9,7325 10TH ST,RIO LINDA,95673,CA,3,2,1146,Residential,Wed May 21 00:00:00 EDT 2008,98937,38.700909,-121.442979

In [99]:
d=df2.describe()

In [100]:
d

,zip,beds,baths,sq__ft,price,latitude,longitude
count,985.000000,985.000000,985.000000,985.000000,985.000000,985.000000,985.000000
mean,95750.697462,2.911675,1.776650,1314.916751,234144.263959,38.607732,-121.355982
std,85.176072,1.307932,0.895371,853.048243,138365.839085,0.145433,0.138278
min,95603.000000,0.000000,0.000000,0.000000,1551.000000,38.241514,-121.551704
25%,95660.000000,2.000000,1.000000,952.000000,145000.000000,38.482717,-121.446127
50%,95762.000000,3.000000,2.000000,1304.000000,213750.000000,38.626582,-121.376220
75%,95828.000000,4.000000,2.000000,1718.000000,300000.000000,38.695589,-121.295778
max,95864.000000,8.000000,5.000000,5822.000000,884790.000000,39.020808,-120.597599